Revit 2027 API
PartMakerMethodToDivideVolumes.GetSketchCurves Method
 Populates the array with copies of curves in the sketch.
Namespace: Autodesk.Revit.DB
Assembly: RevitAPI (in RevitAPI.dll) Version: 27.0.4.0 (27.0.4.0)
Syntax
public void GetSketchCurves(
	out IList<Curve> curveArray
)
Public Sub GetSketchCurves (
	<OutAttribute> ByRef curveArray As IList(Of Curve)
)
public:
void GetSketchCurves(
	[OutAttribute] IList<Curve^>^% curveArray
)
member GetSketchCurves :
        curveArray : IList<Curve> byref -> unit
Parameters
curveArray IList<Curve>
 Curves in the sketch. Tags of the curves are consistent with the curve tags used in part keys.
See Also
Reference
PartMakerMethodToDivideVolumes Class
Autodesk.Revit.DB Namespace